---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.AreaReinforcementLayerType.TopOrFrontMinor
enum: Autodesk.Revit.DB.Structure.AreaReinforcementLayerType
source: html/46b15eb7-46c4-2ed9-df2d-417777518f18.htm
---
# Autodesk.Revit.DB.Structure.AreaReinforcementLayerType.TopOrFrontMinor

Reinforcement layer is on the top face of a floor host, or on the front face of a wall host in the minor direction.